Name: Piyush Ghotakr    Roll No.:58

In [2]:
#Here we have imported the libraries that we will help us.
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
%matplotlib inline

In [3]:
#Here we have imported the dataset name as Titanic.csv by providing it's location in the particular desktop.
a=pd.read_csv('Titanic.csv')

In [4]:
#Here we will be printing the whole dataset just by providing name of the dataset here its named as 'a'
a[:5]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S,0

In [35]:
#As the size of the dataset is bit high we will be printing the top(head) data items from dataset here their are 5 dataitems printing.
a.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S,0

In [37]:
#Here we will be counting the No. of dataitems in each coloumns
a.count()

PassengerId    891
Pclass         891
Name           891
Sex            891
Age            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
Survived       891
dtype: int64

In [38]:
#Here we are droping the label Cabin as by genereal view its representing nothing hence we will simply consider it to be useless and drop the whole coloumn.
a.drop("Cabin",inplace=True,axis=1)

In [39]:
#Here we will just check No. of total null values present in each columns
a.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
Survived       0
dtype: int64

In [ ]:
#Here we will be droping all the null values present by placing  
a.dropna(inplace=True)

In [19]:
#Here again we will be checking wheather the null values are removed or not by simply writing isnull.sum function again
a.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Survived       0
dtype: int64

In [20]:
#Here we will label every character value with some unique No. just by using label encoder which label value with unique number
from sklearn.preprocessing import LabelEncoder
enc = LabelEncoder()
df1 = a.apply(enc.fit_transform)
df1.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,0,2,108,1,28,1,0,522,18,2,0
1,1,0,190,0,52,1,0,595,207,0,1
2,2,2,353,0,34,0,0,668,41,2,1
3,3,0,272,0,48,1,0,48,189,2,1
4,4,2,15,1,48,0,0,471,43,2,0

In [40]:
#Here Survived is our target variable hence for testing we need to drop the target variable
X = df1.drop("Survived",axis=1)
y = df1["Survived"]

In [41]:
#Here we will be declaring training & Testing Variables & printing the shape(Rows, coloumns)
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X, y, test_size=0.25)
print (x_train.shape, x_test.shape)

((666, 10), (223, 10))

In [23]:
from sklearn.linear_model import LogisticRegression
logmodel = LogisticRegression(C=1.0, solver='lbfgs', multi_class='ovr')
logmodel.fit(X,y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='lbfgs', tol=0.0001,
          verbose=0, warm_start=False)

In [25]:
predictions = logmodel.predict(x_test)
from sklearn.metrics import classification_report
print(classification_report(y_test, predictions))

             precision    recall  f1-score   support

          0       0.81      0.88      0.85       136
          1       0.79      0.68      0.73        87

avg / total       0.80      0.80      0.80       223

In [26]:
from sklearn.metrics import confusion_matrix
confusion_matrix(y_test, predictions)

array([[120,  16],
       [ 28,  59]], dtype=int64)